IDEA Open Model
StagesLoading Class
Compatible with IDEA StatiCa Beta 20.0
 Stages loading
Inheritance Hierarchy
System.Object
 IdeaRS.OpenModel.OpenObject
 IdeaRS.OpenModel.Concrete.Load.StagesLoading
 Namespace: IdeaRS.OpenModel.Concrete.Load
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.2
Syntax
public class StagesLoading : OpenObject
Public Class StagesLoading
	Inherits OpenObject
The StagesLoading type exposes the following members.
Constructors
Name | Description
StagesLoading
 Constructor
Top
Properties
Name | Description
CssComponentLoad
 Cross-section component loading
CssEffectType
 Type of effects in cross-section component
PermanentLoad
 Permanent loading
PrestressInputType
 Type of input of prestressing
PrestressLoad
 Prestress loading
TendonComponentLoad
 Tendon component loading
Top
See Also
Reference
IdeaRS.OpenModel.Concrete.Load Namespace